zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxEvadc_bf.h
/** \brief Mask for Ifx_EVADC_G_VFR_Bits.VF9 */
#define IFX_EVADC_G_VFR_VF9_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_VFR_Bits.VF9 */
#define IFX_EVADC_G_VFR_VF9_OFF (9u)

/** \brief Length for Ifx_EVADC_G_VFR_Bits.VF10 */
#define IFX_EVADC_G_VFR_VF10_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_VFR_Bits.VF10 */
#define IFX_EVADC_G_VFR_VF10_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_VFR_Bits.VF10 */
#define IFX_EVADC_G_VFR_VF10_OFF (10u)

/** \brief Length for Ifx_EVADC_G_VFR_Bits.VF11 */
#define IFX_EVADC_G_VFR_VF11_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_VFR_Bits.VF11 */
#define IFX_EVADC_G_VFR_VF11_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_VFR_Bits.VF11 */
#define IFX_EVADC_G_VFR_VF11_OFF (11u)

/** \brief Length for Ifx_EVADC_G_VFR_Bits.VF12 */
#define IFX_EVADC_G_VFR_VF12_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_VFR_Bits.VF12 */
#define IFX_EVADC_G_VFR_VF12_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_VFR_Bits.VF12 */
#define IFX_EVADC_G_VFR_VF12_OFF (12u)

/** \brief Length for Ifx_EVADC_G_VFR_Bits.VF13 */
#define IFX_EVADC_G_VFR_VF13_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_VFR_Bits.VF13 */
#define IFX_EVADC_G_VFR_VF13_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_VFR_Bits.VF13 */
#define IFX_EVADC_G_VFR_VF13_OFF (13u)

/** \brief Length for Ifx_EVADC_G_VFR_Bits.VF14 */
#define IFX_EVADC_G_VFR_VF14_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_VFR_Bits.VF14 */
#define IFX_EVADC_G_VFR_VF14_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_VFR_Bits.VF14 */
#define IFX_EVADC_G_VFR_VF14_OFF (14u)

/** \brief Length for Ifx_EVADC_G_VFR_Bits.VF15 */
#define IFX_EVADC_G_VFR_VF15_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_VFR_Bits.VF15 */
#define IFX_EVADC_G_VFR_VF15_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_VFR_Bits.VF15 */
#define IFX_EVADC_G_VFR_VF15_OFF (15u)

/** \brief Length for Ifx_EVADC_G_CHCTR_Bits.ICLSEL */
#define IFX_EVADC_G_CHCTR_ICLSEL_LEN (2u)

/** \brief Mask for Ifx_EVADC_G_CHCTR_Bits.ICLSEL */
#define IFX_EVADC_G_CHCTR_ICLSEL_MSK (0x3u)

/** \brief Offset for Ifx_EVADC_G_CHCTR_Bits.ICLSEL */
#define IFX_EVADC_G_CHCTR_ICLSEL_OFF (0u)

/** \brief Length for Ifx_EVADC_G_CHCTR_Bits.BNDSELL */
#define IFX_EVADC_G_CHCTR_BNDSELL_LEN (2u)

/** \brief Mask for Ifx_EVADC_G_CHCTR_Bits.BNDSELL */
#define IFX_EVADC_G_CHCTR_BNDSELL_MSK (0x3u)

/** \brief Offset for Ifx_EVADC_G_CHCTR_Bits.BNDSELL */
#define IFX_EVADC_G_CHCTR_BNDSELL_OFF (4u)

/** \brief Length for Ifx_EVADC_G_CHCTR_Bits.BNDSELU */
#define IFX_EVADC_G_CHCTR_BNDSELU_LEN (2u)

/** \brief Mask for Ifx_EVADC_G_CHCTR_Bits.BNDSELU */
#define IFX_EVADC_G_CHCTR_BNDSELU_MSK (0x3u)

/** \brief Offset for Ifx_EVADC_G_CHCTR_Bits.BNDSELU */
#define IFX_EVADC_G_CHCTR_BNDSELU_OFF (6u)

/** \brief Length for Ifx_EVADC_G_CHCTR_Bits.CHEVMODE */
#define IFX_EVADC_G_CHCTR_CHEVMODE_LEN (2u)

/** \brief Mask for Ifx_EVADC_G_CHCTR_Bits.CHEVMODE */
#define IFX_EVADC_G_CHCTR_CHEVMODE_MSK (0x3u)

/** \brief Offset for Ifx_EVADC_G_CHCTR_Bits.CHEVMODE */
#define IFX_EVADC_G_CHCTR_CHEVMODE_OFF (8u)

/** \brief Length for Ifx_EVADC_G_CHCTR_Bits.SYNC */
#define IFX_EVADC_G_CHCTR_SYNC_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_CHCTR_Bits.SYNC */
#define IFX_EVADC_G_CHCTR_SYNC_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_CHCTR_Bits.SYNC */
#define IFX_EVADC_G_CHCTR_SYNC_OFF (10u)

/** \brief Length for Ifx_EVADC_G_CHCTR_Bits.REFSEL */
#define IFX_EVADC_G_CHCTR_REFSEL_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_CHCTR_Bits.REFSEL */
#define IFX_EVADC_G_CHCTR_REFSEL_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_CHCTR_Bits.REFSEL */
#define IFX_EVADC_G_CHCTR_REFSEL_OFF (11u)

/** \brief Length for Ifx_EVADC_G_CHCTR_Bits.BNDSELX */
#define IFX_EVADC_G_CHCTR_BNDSELX_LEN (4u)

/** \brief Mask for Ifx_EVADC_G_CHCTR_Bits.BNDSELX */
#define IFX_EVADC_G_CHCTR_BNDSELX_MSK (0xfu)

/** \brief Offset for Ifx_EVADC_G_CHCTR_Bits.BNDSELX */
#define IFX_EVADC_G_CHCTR_BNDSELX_OFF (12u)

/** \brief Length for Ifx_EVADC_G_CHCTR_Bits.RESREG */
#define IFX_EVADC_G_CHCTR_RESREG_LEN (4u)

/** \brief Mask for Ifx_EVADC_G_CHCTR_Bits.RESREG */
#define IFX_EVADC_G_CHCTR_RESREG_MSK (0xfu)

/** \brief Offset for Ifx_EVADC_G_CHCTR_Bits.RESREG */
#define IFX_EVADC_G_CHCTR_RESREG_OFF (16u)

/** \brief Length for Ifx_EVADC_G_CHCTR_Bits.RESTGT */
#define IFX_EVADC_G_CHCTR_RESTGT_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_CHCTR_Bits.RESTGT */
#define IFX_EVADC_G_CHCTR_RESTGT_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_CHCTR_Bits.RESTGT */
#define IFX_EVADC_G_CHCTR_RESTGT_OFF (20u)

/** \brief Length for Ifx_EVADC_G_CHCTR_Bits.RESPOS */
#define IFX_EVADC_G_CHCTR_RESPOS_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_CHCTR_Bits.RESPOS */
#define IFX_EVADC_G_CHCTR_RESPOS_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_CHCTR_Bits.RESPOS */
#define IFX_EVADC_G_CHCTR_RESPOS_OFF (21u)

/** \brief Length for Ifx_EVADC_G_CHCTR_Bits.BWDCH */
#define IFX_EVADC_G_CHCTR_BWDCH_LEN (2u)

/** \brief Mask for Ifx_EVADC_G_CHCTR_Bits.BWDCH */
#define IFX_EVADC_G_CHCTR_BWDCH_MSK (0x3u)

/** \brief Offset for Ifx_EVADC_G_CHCTR_Bits.BWDCH */
#define IFX_EVADC_G_CHCTR_BWDCH_OFF (28u)

/** \brief Length for Ifx_EVADC_G_CHCTR_Bits.BWDEN */
#define IFX_EVADC_G_CHCTR_BWDEN_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_CHCTR_Bits.BWDEN */
#define IFX_EVADC_G_CHCTR_BWDEN_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_CHCTR_Bits.BWDEN */
#define IFX_EVADC_G_CHCTR_BWDEN_OFF (30u)

/** \brief Length for Ifx_EVADC_G_RCR_Bits.DRCTR */
#define IFX_EVADC_G_RCR_DRCTR_LEN (4u)

/** \brief Mask for Ifx_EVADC_G_RCR_Bits.DRCTR */
#define IFX_EVADC_G_RCR_DRCTR_MSK (0xfu)

/** \brief Offset for Ifx_EVADC_G_RCR_Bits.DRCTR */
#define IFX_EVADC_G_RCR_DRCTR_OFF (16u)

/** \brief Length for Ifx_EVADC_G_RCR_Bits.DMM */
#define IFX_EVADC_G_RCR_DMM_LEN (2u)

/** \brief Mask for Ifx_EVADC_G_RCR_Bits.DMM */
#define IFX_EVADC_G_RCR_DMM_MSK (0x3u)

/** \brief Offset for Ifx_EVADC_G_RCR_Bits.DMM */
#define IFX_EVADC_G_RCR_DMM_OFF (20u)

/** \brief Length for Ifx_EVADC_G_RCR_Bits.WFR */
#define IFX_EVADC_G_RCR_WFR_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_RCR_Bits.WFR */
#define IFX_EVADC_G_RCR_WFR_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_RCR_Bits.WFR */
#define IFX_EVADC_G_RCR_WFR_OFF (24u)

/** \brief Length for Ifx_EVADC_G_RCR_Bits.FEN */
#define IFX_EVADC_G_RCR_FEN_LEN (2u)

