zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxEvadc_bf.h
/** \brief Mask for Ifx_EVADC_G_RCR_Bits.FEN */
#define IFX_EVADC_G_RCR_FEN_MSK (0x3u)

/** \brief Offset for Ifx_EVADC_G_RCR_Bits.FEN */
#define IFX_EVADC_G_RCR_FEN_OFF (25u)

/** \brief Length for Ifx_EVADC_G_RCR_Bits.SRGEN */
#define IFX_EVADC_G_RCR_SRGEN_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_RCR_Bits.SRGEN */
#define IFX_EVADC_G_RCR_SRGEN_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_RCR_Bits.SRGEN */
#define IFX_EVADC_G_RCR_SRGEN_OFF (31u)

/** \brief Length for Ifx_EVADC_G_RES_Bits.RESULT */
#define IFX_EVADC_G_RES_RESULT_LEN (16u)

/** \brief Mask for Ifx_EVADC_G_RES_Bits.RESULT */
#define IFX_EVADC_G_RES_RESULT_MSK (0xffffu)

/** \brief Offset for Ifx_EVADC_G_RES_Bits.RESULT */
#define IFX_EVADC_G_RES_RESULT_OFF (0u)

/** \brief Length for Ifx_EVADC_G_RES_Bits.DRC */
#define IFX_EVADC_G_RES_DRC_LEN (4u)

/** \brief Mask for Ifx_EVADC_G_RES_Bits.DRC */
#define IFX_EVADC_G_RES_DRC_MSK (0xfu)

/** \brief Offset for Ifx_EVADC_G_RES_Bits.DRC */
#define IFX_EVADC_G_RES_DRC_OFF (16u)

/** \brief Length for Ifx_EVADC_G_RES_Bits.CHNR */
#define IFX_EVADC_G_RES_CHNR_LEN (5u)

/** \brief Mask for Ifx_EVADC_G_RES_Bits.CHNR */
#define IFX_EVADC_G_RES_CHNR_MSK (0x1fu)

/** \brief Offset for Ifx_EVADC_G_RES_Bits.CHNR */
#define IFX_EVADC_G_RES_CHNR_OFF (20u)

/** \brief Length for Ifx_EVADC_G_RES_Bits.EMUX */
#define IFX_EVADC_G_RES_EMUX_LEN (3u)

/** \brief Mask for Ifx_EVADC_G_RES_Bits.EMUX */
#define IFX_EVADC_G_RES_EMUX_MSK (0x7u)

/** \brief Offset for Ifx_EVADC_G_RES_Bits.EMUX */
#define IFX_EVADC_G_RES_EMUX_OFF (25u)

/** \brief Length for Ifx_EVADC_G_RES_Bits.CRS */
#define IFX_EVADC_G_RES_CRS_LEN (2u)

/** \brief Mask for Ifx_EVADC_G_RES_Bits.CRS */
#define IFX_EVADC_G_RES_CRS_MSK (0x3u)

/** \brief Offset for Ifx_EVADC_G_RES_Bits.CRS */
#define IFX_EVADC_G_RES_CRS_OFF (28u)

/** \brief Length for Ifx_EVADC_G_RES_Bits.VF */
#define IFX_EVADC_G_RES_VF_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_RES_Bits.VF */
#define IFX_EVADC_G_RES_VF_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_RES_Bits.VF */
#define IFX_EVADC_G_RES_VF_OFF (31u)

/** \brief Length for Ifx_EVADC_G_RESD_Bits.RESULT */
#define IFX_EVADC_G_RESD_RESULT_LEN (16u)

/** \brief Mask for Ifx_EVADC_G_RESD_Bits.RESULT */
#define IFX_EVADC_G_RESD_RESULT_MSK (0xffffu)

/** \brief Offset for Ifx_EVADC_G_RESD_Bits.RESULT */
#define IFX_EVADC_G_RESD_RESULT_OFF (0u)

/** \brief Length for Ifx_EVADC_G_RESD_Bits.DRC */
#define IFX_EVADC_G_RESD_DRC_LEN (4u)

/** \brief Mask for Ifx_EVADC_G_RESD_Bits.DRC */
#define IFX_EVADC_G_RESD_DRC_MSK (0xfu)

/** \brief Offset for Ifx_EVADC_G_RESD_Bits.DRC */
#define IFX_EVADC_G_RESD_DRC_OFF (16u)

/** \brief Length for Ifx_EVADC_G_RESD_Bits.CHNR */
#define IFX_EVADC_G_RESD_CHNR_LEN (5u)

/** \brief Mask for Ifx_EVADC_G_RESD_Bits.CHNR */
#define IFX_EVADC_G_RESD_CHNR_MSK (0x1fu)

/** \brief Offset for Ifx_EVADC_G_RESD_Bits.CHNR */
#define IFX_EVADC_G_RESD_CHNR_OFF (20u)

/** \brief Length for Ifx_EVADC_G_RESD_Bits.EMUX */
#define IFX_EVADC_G_RESD_EMUX_LEN (3u)

/** \brief Mask for Ifx_EVADC_G_RESD_Bits.EMUX */
#define IFX_EVADC_G_RESD_EMUX_MSK (0x7u)

/** \brief Offset for Ifx_EVADC_G_RESD_Bits.EMUX */
#define IFX_EVADC_G_RESD_EMUX_OFF (25u)

/** \brief Length for Ifx_EVADC_G_RESD_Bits.CRS */
#define IFX_EVADC_G_RESD_CRS_LEN (2u)

/** \brief Mask for Ifx_EVADC_G_RESD_Bits.CRS */
#define IFX_EVADC_G_RESD_CRS_MSK (0x3u)

/** \brief Offset for Ifx_EVADC_G_RESD_Bits.CRS */
#define IFX_EVADC_G_RESD_CRS_OFF (28u)

/** \brief Length for Ifx_EVADC_G_RESD_Bits.VF */
#define IFX_EVADC_G_RESD_VF_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_RESD_Bits.VF */
#define IFX_EVADC_G_RESD_VF_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_RESD_Bits.VF */
#define IFX_EVADC_G_RESD_VF_OFF (31u)

/** \brief Length for Ifx_EVADC_FC_FCCTRL_Bits.STCF */
#define IFX_EVADC_FC_FCCTRL_STCF_LEN (5u)

/** \brief Mask for Ifx_EVADC_FC_FCCTRL_Bits.STCF */
#define IFX_EVADC_FC_FCCTRL_STCF_MSK (0x1fu)

/** \brief Offset for Ifx_EVADC_FC_FCCTRL_Bits.STCF */
#define IFX_EVADC_FC_FCCTRL_STCF_OFF (0u)

/** \brief Length for Ifx_EVADC_FC_FCCTRL_Bits.RPE */
#define IFX_EVADC_FC_FCCTRL_RPE_LEN (1u)

/** \brief Mask for Ifx_EVADC_FC_FCCTRL_Bits.RPE */
#define IFX_EVADC_FC_FCCTRL_RPE_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_FC_FCCTRL_Bits.RPE */
#define IFX_EVADC_FC_FCCTRL_RPE_OFF (5u)

/** \brief Length for Ifx_EVADC_FC_FCCTRL_Bits.AIPF */
#define IFX_EVADC_FC_FCCTRL_AIPF_LEN (2u)

/** \brief Mask for Ifx_EVADC_FC_FCCTRL_Bits.AIPF */
#define IFX_EVADC_FC_FCCTRL_AIPF_MSK (0x3u)

/** \brief Offset for Ifx_EVADC_FC_FCCTRL_Bits.AIPF */
#define IFX_EVADC_FC_FCCTRL_AIPF_OFF (6u)

/** \brief Length for Ifx_EVADC_FC_FCCTRL_Bits.CHEVMODE */
#define IFX_EVADC_FC_FCCTRL_CHEVMODE_LEN (2u)

/** \brief Mask for Ifx_EVADC_FC_FCCTRL_Bits.CHEVMODE */
#define IFX_EVADC_FC_FCCTRL_CHEVMODE_MSK (0x3u)

/** \brief Offset for Ifx_EVADC_FC_FCCTRL_Bits.CHEVMODE */
#define IFX_EVADC_FC_FCCTRL_CHEVMODE_OFF (8u)

/** \brief Length for Ifx_EVADC_FC_FCCTRL_Bits.DIVA */
#define IFX_EVADC_FC_FCCTRL_DIVA_LEN (5u)

/** \brief Mask for Ifx_EVADC_FC_FCCTRL_Bits.DIVA */
#define IFX_EVADC_FC_FCCTRL_DIVA_MSK (0x1fu)

/** \brief Offset for Ifx_EVADC_FC_FCCTRL_Bits.DIVA */
#define IFX_EVADC_FC_FCCTRL_DIVA_OFF (10u)

/** \brief Length for Ifx_EVADC_FC_FCCTRL_Bits.CPWC */
#define IFX_EVADC_FC_FCCTRL_CPWC_LEN (1u)

/** \brief Mask for Ifx_EVADC_FC_FCCTRL_Bits.CPWC */
#define IFX_EVADC_FC_FCCTRL_CPWC_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_FC_FCCTRL_Bits.CPWC */
#define IFX_EVADC_FC_FCCTRL_CPWC_OFF (15u)

/** \brief Length for Ifx_EVADC_FC_FCCTRL_Bits.XTSEL */
#define IFX_EVADC_FC_FCCTRL_XTSEL_LEN (4u)

/** \brief Mask for Ifx_EVADC_FC_FCCTRL_Bits.XTSEL */
#define IFX_EVADC_FC_FCCTRL_XTSEL_MSK (0xfu)

/** \brief Offset for Ifx_EVADC_FC_FCCTRL_Bits.XTSEL */
#define IFX_EVADC_FC_FCCTRL_XTSEL_OFF (16u)

/** \brief Length for Ifx_EVADC_FC_FCCTRL_Bits.XTLVL */
#define IFX_EVADC_FC_FCCTRL_XTLVL_LEN (1u)

/** \brief Mask for Ifx_EVADC_FC_FCCTRL_Bits.XTLVL */
#define IFX_EVADC_FC_FCCTRL_XTLVL_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_FC_FCCTRL_Bits.XTLVL */
#define IFX_EVADC_FC_FCCTRL_XTLVL_OFF (20u)

/** \brief Length for Ifx_EVADC_FC_FCCTRL_Bits.XTMODE */
#define IFX_EVADC_FC_FCCTRL_XTMODE_LEN (2u)

/** \brief Mask for Ifx_EVADC_FC_FCCTRL_Bits.XTMODE */
#define IFX_EVADC_FC_FCCTRL_XTMODE_MSK (0x3u)

/** \brief Offset for Ifx_EVADC_FC_FCCTRL_Bits.XTMODE */
#define IFX_EVADC_FC_FCCTRL_XTMODE_OFF (21u)

/** \brief Length for Ifx_EVADC_FC_FCCTRL_Bits.XTPOL */
#define IFX_EVADC_FC_FCCTRL_XTPOL_LEN (1u)

/** \brief Mask for Ifx_EVADC_FC_FCCTRL_Bits.XTPOL */
#define IFX_EVADC_FC_FCCTRL_XTPOL_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_FC_FCCTRL_Bits.XTPOL */
#define IFX_EVADC_FC_FCCTRL_XTPOL_OFF (23u)

/** \brief Length for Ifx_EVADC_FC_FCCTRL_Bits.GTMODE */
#define IFX_EVADC_FC_FCCTRL_GTMODE_LEN (2u)

/** \brief Mask for Ifx_EVADC_FC_FCCTRL_Bits.GTMODE */
#define IFX_EVADC_FC_FCCTRL_GTMODE_MSK (0x3u)

/** \brief Offset for Ifx_EVADC_FC_FCCTRL_Bits.GTMODE */
#define IFX_EVADC_FC_FCCTRL_GTMODE_OFF (24u)

